[{"model": "stories.sport", "pk": 1, "fields": {"author": 1, "title": "EA Sports FC 24 Player Ratings: Kylian Mbappé, Erling Haaland Lead Top Stars", "bio": "An expected cast of characters tops EA Sports' FC 24 player rankings ahead of the game's launch on Sept. 29", "first_letter": "P", "content": "<p>SG star attacker Kylian Mbapp&eacute;, Manchester City teammates Erling Haaland and Kevin De Bruyne and Spanish midfield maestro Alexis Putellas each earned a 91 rating.</p>\r\n\r\n<p>A number of big names garnered a 90 rating, most notably Inter Miami legend Lionel Messi. He was joined by Aitana Bonmat&iacute;, Sam Kerr, Karim Benzema, Thibaut Courtois, Harry Kane, Robert Lewandowski and Caroline Graham Hansen.</p>\r\n\r\n<p>Other notable ratings included Liverpool star Mohamed Salah (89), USWNT striker Alex Morgan (89) and veteran star Neymar (89).</p>", "desk_image": "desk_covers/mbape.jpg", "publication_date": "2023-09-12"}}, {"model": "stories.sport", "pk": 2, "fields": {"author": 1, "title": "Juventus' Paul Pogba Provisionally Suspended After Testing Positive for Testosterone", "bio": "Juventus and France midfielder Paul Pogba has been provisionally suspended after testing positive for testosterone following a 3-0 win over Udinese on Aug. 20, according to Fabrizio Romano", "first_letter": "P", "content": "<p>ogba, 30, could now be facing a multiple-year ban from the sport if he&#39;s indeed found guilty of doping.</p>\r\n\r\n<p>Pogba has made two appearances for Juventus but no starts this season after making just one start in the 2022-23 campaign. Injuries largely kept him off the pitch both for Juventus and France, which included him missing the World Cup in Qatar.</p>\r\n\r\n<p>He also was allegedly the victim of a &euro;13 million ($13.9 million) extortion plot from his brother Mathias and friends from his childhood.</p>\r\n\r\n<p>&quot;Money changes people. ... It can break up a family,&quot; he told&nbsp;<a href=\"https://www.aljazeera.com/program/generation-change/2023/9/11/paul-pogba-faith-fame-and-police-violence\" rel=\"noopener\" target=\"_blank\">Al Jazeera&#39;s Generation Sport</a>&nbsp;(h/t&nbsp;<a href=\"https://www.espn.com/soccer/story/_/id/38377330/juventus-france-star-paul-pogba-considered-retiring-football-extortion-case\" rel=\"noopener\" target=\"_blank\">ESPN</a>). &quot;It can create a war. Sometimes I was just by myself thinking, &#39;I don&#39;t want to have money anymore. I just don&#39;t want to play anymore. I just want to be with normal people, so they will love me for me&mdash;not for the fame, not for the money.&#39; Sometimes it&#39;s tough.&quot;</p>\r\n\r\n<p>Pogba has starred for Manchester United, Juventus and the French national team, most prominently winning the World Cup in 2018 and four titles with Juventus.</p>\r\n\r\n<p>But his second spell at Juventus has largely been a struggle, and Pogba was hoping to prove he was still one of the game&#39;s biggest talents.</p>\r\n\r\n<p>&quot;I want to make them eat their words,&quot; he said of his critics. &quot;... I want to show them I&#39;m not weak. They can talk bad about me. I will never give up.&quot;</p>\r\n\r\n<p>&quot;Football is very beautiful, but is cruel. People can forget you in one day. You can do something great, but the next day you are nobody,&quot; he continued. &quot;People are waiting for you, saying: &#39;He&#39;s done, his career is finished.&#39; You get these comments after scoring goals, and winning the World Cup. People forget it. So you have to prove all the time.&quot;</p>\r\n\r\n<p>Now, however, it&#39;s unclear if Pogba will ever feature in a Juventus shirt&mdash;or any other kit, for that matter&mdash;again.</p>", "desk_image": "desk_covers/charles-etoroma-B-f1Fa_ByrQ-unsplash.jpg", "publication_date": "2023-09-12"}}, {"model": "stories.sport", "pk": 3, "fields": {"author": 1, "title": "Video: Neymar Passes Pele to Become Brazil's All-Time Leading Goal Scorer", "bio": "Neymar has officially overtaken Pele as the most prolific scorer in Brazil's history.", "first_letter": "T", "content": "<p>he Brazilian soccer legend scored the 78th goal of his international career Friday during Brazil&#39;s World Cup qualifier against Bolivia to surpass Pele&#39;s record.</p>\r\n\r\n<p>Early in the first half, Neymar had earned a chance to break the record on a&nbsp;<a href=\"https://twitter.com/TelemundoSports/status/1700315417837744570?s=20\" rel=\"noopener\" target=\"_blank\">penalty kick</a>, but was his shot was saved.</p>\r\n\r\n<p>It wasn&#39;t until the 60th minute that Neymar was able to convert. This time, the goalkeeper had no chance.</p>\r\n\r\n<p>Neymar, who has been recovering from an ankle injury he suffered in February, has not played for Brazil since the 2022 World Cup.</p>\r\n\r\n<p>The former Paris Saint-Germain star recently joined the Saudi Professional League but has yet to play for Al-Hilal.</p>\r\n\r\n<p>Neymar is set to play for Brazil again when the team takes on Peru in its next qualifying game Tuesday.</p>", "desk_image": "desk_covers/gustavo-ferreira-mGMWpkCdTuU-unsplash.jpg", "publication_date": "2023-09-12"}}]