[{"model": "stories.story", "pk": 1, "fields": {"title": "Story of my life", "first_letter": "T", "content": "<p>his is piece is about my early life in school. My very first days in school. I&#39;m pretty sure I have told you how I ended up in school,had it not been those circumstances, perhaps now I would be cuddling with my gun,ready to go raid and make my father proud,or amassing my wealth Or perhaps I would be somewhere lying on trench, after taking a few sips of chang&#39;aa (this is the way for most of the youth who haven&#39;t made it through, you know sometimes life gives you too much stick,some you just give up and move with life&#39;s pace).</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; Not everyone though, what now comes to separate various people is their versatility,work ethic, exposure and social network,but more so the latter, I&#39;m told that you call it connection. But here I am. God is good. Here I am writing you stories, something I never thought I would do. To me, it&#39;s actually a big deal to even be able to write or speak in a language I wasn&#39;t brought up with. You? First of all I just accepted reluctantly to go to school. Why? Because at that time AIDS was flexing its muscles. And we believed that AIDS came from those people who went to school, because there&#39;s no way AIDS just popped up in Pokot just like that. It made sense. AIDS travelled in motor vehicles,si ata nyinyi mnajua ukimwi ilianza huku town,halafu sasa ikaspread? Watu wa town,this isn&#39;t an insult, please take it easy. So we believed that once one went to school,he would interact with people who have AIDS, and therefore he would have AIDS. We never questioned how AIDS is transmitted. None of our business, what mattered was, AIDS was dangerous.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; That was it. And AIDS was in school. AIDS was school and school was AIDS and so was town ( town here is referring to two shops and one milling machine,so on my maiden visit to Nairobi, seeing a multitude of people and cloud-kissing buildings made me believe that this was either heaven or another planet. Shocked at my weird imagination of heaven? Visit Pokot. But that was then, right now things have changed, albeit a little. But calling it a town is enough for a toddler to judge that English is being misused. So when one sad afternoon I left my brothers for school,they just had to accept that they had lost me to AIDS, I also had to accept that I had to face it. I walked slowly behind my mom,your eyes must always be on your mother&#39;s back ( as the adage goes). She was taking me to a certain lady who I was to stay at her place because school was quite far from home and it wasn&#39;t healthy for a starter,a tiny boy ( put in your mind that right now I am 1GB) so I wonder what I was those days.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; Thank God we never had any tornadoes, otherwise I would have been carried away to the heavens never to return. Or to another universe. Anyways. Arriving at school, there was one confused creature, mesmerized by his environment, not knowing where he belongs, with a thin piece of shuka wrapped across his waist,at least to cover his rashy bottoms so that the world does not see. Shocked by kids running around making noise like lunatics. Why couldn&#39;t they just chill? Though no Netflix? That creature was Lopanga, these days you call him Mabonga. You see I just didn&#39;t like the whole thing. I was missing my goats, I was missing interacting with a goat&#39;s teats for breakfast. I just felt out of place. Granted an opportunity, I would just rush home and give up the whole idea of school. I was taken to that lady,she did take me in as one of her sons,she had her sons,who wholeheartedly took me as one of their brothers. I actually feel emotional while writing this,how could someone show me this love. Still baffles me. But I think all my life,at least upto this point I have to say that I have lived because of other people&#39;s love. Love is there. It is alive and it is the most beautiful thing. I will live to be forever grateful ( you have read my Story?) So my mom left. And I was left with people I had not even an iota of idea of.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; The following day came. And we went to school. Carrying firewood. Because food had to be cooked, with fire. Wood provided fire. Too obvious huh? So we went to school. After a short while, One of the big students (is pupils more appropriate?) rang the bell,and I was wondering why is he misusing the cattle&#39;s bell like that? I mean it should be strapped on the neck of a cow. For obvious reasons. Later I was told that was a bell, school bell,not cattle&#39;s bell. I think I was learning slowly but sure. So I noticed that the lunatics were running to assemble at one place, like an assembly. I ran with them, was later told that it was called parade, where teachers addressed the school. Later I realized it was less stressful to say &#39;paret&#39; . I mean what was the point of making life hard when you could just easy away. You see,we, the people of the North find our way out of things,we simplify life, it&#39;s not a doubt that life is already hard,why aggravate it huh? Like that imperial leather soap,we call it mbiriol. As short as that,so that was that. My experience was awesome,as awkward as it was. So I was taken to the staffroom, the headteacher admitted me, asked me what I wanted to be when I grow up. I had no idea man,why was he troubling me with such questions.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; He however gave me clues and I told that I had always wanted to become a doctor. Caaap, so I was taken straight to class one. Yes, with a thin strip of a shuka on my waist,a miniscule part of it covered my ninio,and the front too. By the way, before these wazungus came with their clothes,our people used to cover themselves with goat hides, women just needed to cover their lower part, front and back,on the side was free,and a lady had broad hips, the hips wouldn&#39;t have to fight for a space in there, now there&#39;s no specific reason for this but like I said we like life quite simple. Before I forget, ladies also covered their bosoms. But for men,it was way simpler, just a thin strip that covered the two mountains put apart by an ever-dry river on the rear. I know what you are asking yourself, what about the front part, that wasn&#39;t a problem, from here I will not explain, but I take no responsibility in your conclusion. Sorry for the long digression. This is where I just wished to go back and be with my goats, because why? Why wouldn&#39;t I just be left alone man? Why would naughty child come and strip me naked? What did he have with my shuka? Was he longing to become a stripper when he grows up? Why would the teacher ask me to answer a thing I didn&#39;t know. Why would I have to lift up my hand like I&#39;m a magician gathering wind? When I was given a book,to write, and a pencil, I didn&#39;t know what they were for,but I wasn&#39;t too dumb not to notice what my colleagues were doing , okay I wasn&#39;t too bad in visual observations. So I just scribbled through,like prophet Jeremiah&#39;s scribe who wrote not what he knew but what was being told to write. Let&#39;s say nilikuwa naandika tu fwaaa. But at least you understand that One.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; Those were spiritual times,mine wasn&#39;t Or if it was ( ama wacha tu). One time I was caught to have written my book upside down,worse even from the back. Man how on earth would I know the upper and lower side of something? So I was beaten for that. One time we were given assignment to write between 1 to 50. The teacher wrote on the board and told us to copy it directly from the board. Over the break I realized I was going to take 1 million years to copy just number 1. Do that calculation now and see how terrified I was. One reason why I really wanted to go back to mom. So I went to call my foster brother,who happened to be in class 4 then, this was the highest in the school, the school was very young,as a matter of fact the school became a KNEC examination centre in 2014,for the first time. I told him that the teacher had told us to copy from 1- 50 from the board, I explained all my problems as he listened. He helped me,he took my pencil and my book, erased the number 1 I was yet to finish writing. So he started writing without lifting his eyes, I reminded him the work was to be copied from the board,but he told me he knew off head. That&#39;s when I started suspecting him. Writing from 1 to 50 without referring to anywhere,to me, seemed dark magic. I started adapting to school,but one thing was sure. The students were too naughty, noisy and had too much energy.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; Shaggy hair shy of a lunatic. One of the best things about school is that there was food. There was peas, yellow peas. I should do a separate post explaining to you how peas,in one hand can save you from the fangs of hunger,and in another can almost send you to heaven,or the other way, depending on your decisions. And perhaps this is one thing that kept me in school, I knew very well that if I stopped going to school, it would be over between me and peas. It would be over between me and a decent meal. So I buckled up even when my walls were crumbling. Mtu ni kujijua. So I braved on. Did nothing much. But I must shamefully or proudly admit that novelty always puts me in an awkward position, to date. Was he a god to know these things without looking at them? Or was he possessing some powers? He finished writing, and Left, leaving me dump struck. Anyways it was time for class. And just so you know, I passed,we could say with flying colors if that&#39;s not too cliche.. One of the things you went through before being caned by a teacher ( for academic indiscipline) was that your cheeks had to be pinched. You see,this teacher just pinched too much meat. Skin rather. He would then pull and push rhythmically, until you feel like your muscles of the mandibular are disintegrating. If you have seen me with dimples, just know that I was not born with them. They&#39;re man made. Teacher-made. Bora ni dimples. A reiteration that a win is a win. There was one fierce teacher who used to teach us maths, that guy scared hell out of me ( no offense to heaven). This guy had very long nails, very sharp, almost like talons. And when he taught and you knew that if you don&#39;t get the sum correct those talons would go deep inside you. So he used to ask questions. And then you would raise your hand to answer it. Over a time I realized almost all the answers my colleagues were giving were wrong. And they had been in school for a long time than me. Losers! It was again time for me to rethink about this thing,but then food,food. Anyways I realizedmost of the answers they were giving to whatever was asked, whether an addition or subtraction, the answer was always 13. I had taken my time to master how to pronounce 13 so that when the teacher asks a question I can answer it right. 13 was always the answer. And I had chosen it.</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; So one afternoon he asked a question I can&#39;t remember exactly but it was a sum. All of us were on our desks,all our hands raised,he chose another guy he answered 13. It was wrong. Then he noticed that I had raised my hand ( rare occurrence) he pointed at me wit the highest of expectations. And I had only One answer. 13. Makoshaaa. Of course it was wrong. But my colleagues kept guessing, until they got it. It was just not my day man. I would later retreat to the drawing board and master another number. I lived to fight another day. But he seemed to enjoy how we guessed it until we got it. But I was a little annoyed with my colleagues. The ijiots had been in school for long time yet they just guessed? Anyways I didn&#39;t have anything to offer. At least I should have been grateful for the little I had learned from them... the bell rang,it was time for lunch,time for peas😁. And that is what mattered the most. And off for peas we ran. Now,this is where you are going to agree with me that it should just be removed from the education system. Exams. During our exams, the teacher had to read everything and translate it to Pokotese for us to understand, otherwise we wouldn&#39;t know what was going on. He would then read the choices loudly, telling you underline which one is the answer. Some sheep (led by me) still couldn&#39;t get it. Even, the teacher had to write the names for us,we did not know how to write our names, you can imagine how dumb that is. One time when he didn&#39;t write, the names for us I copied everything from my neighbor, even his name(; his name was Loree) But he also didn&#39;t know,yet I copied. The result of this is like those mysterious crooked lines on the wall that the king of Babylon saw. Mene mene tekel. Something like this ( I hope This isn&#39;t blasphemous) and so the teacher had to go look for Daniel so that he interprets those writings on my paper. That was mid term exam,end term came. When it was time for end term, which,by a fact, happened to be a third time of a possible academic calendar,so people were transforming to the next class (2) . But only those separated from the chaff ( do you want to guess whether I was grain or chaff? You are right.).</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; In the mid term I was ranked second last,in a class of roughly 30 students. Imagine! I was a genius Brains buana brains. In the end term, I was third last. Yes. I was making a gradual step. Slow but sure. Jambion. But still I didn&#39;t meet the threshold to proceed to the next class. So I had to continue eating my peas and guessing 13. That was 2009 by the way. Next time I will let you know how and when I stopped doing 13. Kuka peas.</p>", "bio": "THis is basically my life's story thanks in advance.", "author": 1, "publication_date": "2023-06-16", "cover_photo": "story_covers/shalom-mwenesi-6ES3cbjaybk-unsplash.jpg"}}, {"model": "stories.story", "pk": 3, "fields": {"title": "Nikita Kering", "first_letter": "S", "content": "<p>omeone ring Kering<br />\r\nCuz I am Nick. I wanna sing.</p>\r\n\r\n<p>Someone holla at Nikita.<br />\r\nI gotta give her a guitar.</p>\r\n\r\n<p>And though it may be hilly.<br />\r\nI will talk to Lilly. Really.</p>\r\n\r\n<p>I am Lofty. And I want to bonga.<br />\r\nThough bony. Muscle is yonder.</p>\r\n\r\n<p>Lofty Mabonga</p>", "bio": "Someone holla at Nikita", "author": 1, "publication_date": "2023-06-28", "cover_photo": "story_covers/nikita.jpg"}}, {"model": "stories.story", "pk": 5, "fields": {"title": "City in Ruins", "first_letter": "I", "content": "<p>n an endless sea of sand lies a city<br />\r\nResponding to sun&#39;s rays by gleams.<br />\r\nChristened the gleamy eye<br />\r\nOnce shone with prosperity and superiority<br />\r\nCity that once sprouted life and love.<br />\r\nCity that was once a mini heaven</p>\r\n\r\n<p><br />\r\nPeace reigned the day, and serenity the night&nbsp;<br />\r\nWith deep pockets of underground oil<br />\r\nNourishing the entirety of humankind<br />\r\nThe Chief was cherished, the subjects were loved<br />\r\nBut now<br />\r\nA city in ruins</p>\r\n\r\n<p><br />\r\nBillowing smoke from every corner<br />\r\nOnce majestic skyscrapers, terminated<br />\r\nOnce beautiful sky, hidden in clouds<br />\r\nOrphaned children weeping<br />\r\nWidowed women crying<br />\r\nDespair taking wheel</p>\r\n\r\n<p><br />\r\nThe City at the center of geopolitics<br />\r\nA puppet for the West, attempt to unseat a dictator for the Eastern.<br />\r\nEach asserting its power.<br />\r\nThe City is in its deathbed.</p>\r\n\r\n<p><br />\r\nCity is in Ruins.</p>", "bio": "The City at the center of geopolitics", "author": 1, "publication_date": "2023-06-28", "cover_photo": "story_covers/jace-afsoon-6Yo_30FTrm4-unsplash.jpg"}}]